<h1>For Loop</h1>
<!-- for loop คือ เรารู้แน่ๆว่าต้อง loop กี่รอบ -->

<?php 
for ($i = 0; $i < 10; $i++){  
    echo $i;
}
/* for (กำหนดค่าเริ่มต้น; เงื่อนไขของ Loop; ทำงานหลังจาก check เงื่อนไขแล้ว){
    ทำงานจนกว่าจะเข้าเงื่อนไขของ Loop
} */
?>

<hr>


<h1>While Loop</h1>
<!-- Loop จนกว่าเงื่อนไขจะป็น false -->
<?php 
$i = 0;
while($i < 10){
    echo $i;
    $i++;
}
/* 
กำหนดค่าเริ่มต้น
while(เงื่อนไขของ Loop){
    ทำงานจนกว่าเงื่อนไขจะเป็น True
}
*/
?>

<hr>
<h1>Do While Loop</h1>
<!-- ทำงานก่อน 1 รอบก่อนจะเช็คเงื่อนไขทีหลัง -->
<?php
$i = 0;
do{
    echo $i;
    $i++;
}while ($i < 10);
/* 

กำหนดเงื่อนไข
do{
    ทำงานซ้ำจนกว่าเงื่อนไขจะเป็น True
}while(เงื่อนไขของ Loop);
*/


?>
